# Тестирующая программа должна быть реализована в модуле main.py
# Списки и множества использовать запрещено
# Сторонние библиотеки использовать запрещено
# Необходимо реализовать собственную функцию сортировки в отдельном модуле
# Самостоятельно изучить понятие O(n) на примере сортировок из методического пособия. Иметь возможность объяснить на базовом уровне алгоритмическую сложность вашего алгоритма.

# 20.	Реализовать модуль, содержащий функцию нахождения в массиве целых чисел наибольшего по абсолютной величине числа.
